fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_ФормыСлужебный/Module.bsl
#Область ОбработчикиСобытийФорм

Процедура Справочник_ДоговорыКонтрагентов_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда
	
		Элементы = Форма.Элементы;
		Объект = Форма.Объект;
		
		НоваяГруппа = Элементы.Добавить("ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания", 
											Тип("ГруппаФормы"));
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Заголовок = "Информация об абонентском обслуживании";
		НоваяГруппа.ОтображатьЗаголовок = Истина;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
		НоваяГруппа.РастягиватьПоВертикали = Ложь;
		НоваяГруппа.Видимость = Ложь;
		
		НоваяГруппа = Элементы.Добавить("ВКМ_ГруппаНачалоОкончаниеДействияДоговора", 
											Тип("ГруппаФормы"), 
											Элементы.ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Заголовок = "";
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
		НоваяГруппа.РастягиватьПоВертикали = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_НачалоДействияДоговора", 
											Тип("ПолеФормы"), 
											Элементы.ВКМ_ГруппаНачалоОкончаниеДействияДоговора);																		
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
		НовыйЭлемент.Заголовок = "Срок действия договора с";
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_ОкончаниеДействияДоговора", 
											Тип("ПолеФормы"), 
											Элементы.ВКМ_ГруппаНачалоОкончаниеДействияДоговора);																		
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
		НовыйЭлемент.Заголовок = "по";
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	
		НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", 
											Тип("ПолеФормы"), 
											Элементы.ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания);																		
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		НовыйЭлемент.Заголовок = "Сумма абонентской платы";
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	
		НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", 
											Тип("ПолеФормы"), 
											Элементы.ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания);																		
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Заголовок = "Стоимость часа работы";
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
		
		Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			Элементы.ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания.Видимость = Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
